Revit 2027 API
Space.ActualPowerLoad Property
Get the Actual Power Load of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ActualPowerLoad { get; }
Public ReadOnly Property ActualPowerLoad As Double
	Get
public:
property double ActualPowerLoad {
	double get ();
}
member ActualPowerLoad : float with get
Property Value
Double
Remarks
This property is used to get the Actual Power Load of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace